'''
算术运算符
运算符	描述	        实例
+	    加	        两个对象相加 a + b 输出结果 30
-	    减	        得到负数或是一个数减去另一个数 a - b 输出结果 -10
*	    乘	        两个数相乘或是返回一个被重复若干次的字符串 a * b 输出结果 200
/	    除	        b / a 输出结果 2
//	    取整除	    返回商的整数部分 9//2 输出结果 4 , 9.0//2.0 输出结果 4.0
%	    取余	        返回除法的余数 b % a 输出结果 0
**	    指数	        a**b 为10的20次方， 输出结果 100000000000000000000
'''
b = 10
c = 3

a = b // c
print(a)

'''
复合赋值运算符
运算符	描述	            实例
+=	    加法赋值运算符	c += a 等效于 c = c + a
-=	    减法赋值运算符	c -= a 等效于 c = c - a
*=	    乘法赋值运算符	c *= a 等效于 c = c * a
/=	    除法赋值运算符	c /= a 等效于 c = c / a
%=	    取模赋值运算符	c %= a 等效于 c = c % a
**=	    幂赋值运算符	    c ******= a 等效于 c = c **a
//=	    取整除赋值运算符	c //= a 等效于 c = c // a
'''

e = 100
w = 200
e += w
print(e)